from src.presentation.text.variables import OFFER_URL, ACCEPTANCE_URL, POLICY_URL

__USER_ACCEPTANCE_TEXT = f"""*<i>Продолжая использование сервиса и осуществляя регистрацию, Вы подтверждаете, ознакомление и согласие с <a href="{OFFER_URL}">офертой</a> пользователя, а также выражаете <a href="{ACCEPTANCE_URL}">согласие</a> на обработку персональных данных в соответствии с <a href="{POLICY_URL}">политикой</a>.</i>"""

START_FOR_REGISTERED = f"""Рады снова приветствовать вас! 
Нажмите на кнопку <b>Novikov TV Club</b>, чтобы перейти в сервис за эксклюзивными предложениями."""

START = f"""NOVIKOV TV CLUB
<b>Сервис привилегий</b>  

Премиальные услуги  — 
с выгодой <b>до 40%</b>.

💎<i>Салоны красоты, фитнес-клубы, SPA, клиники и еще 20+ категорий</i>

⚪ Только эксклюзивы
⚪ Удобно в Telegram App
⚪ Без подписок и платежей

А еще — это красиво 
Смотреть >>

{__USER_ACCEPTANCE_TEXT}"""

WEBAPP_MESSAGE = "Нажмите на кнопку Novikov TV Club, чтобы перейти в сервис за эксклюзивными предложениям."
